Optimization/kr2.org
#+LATEX_HEADER:\usepackage{amsmath}
#+LATEX_HEADER:\usepackage{esint}
#+LATEX_HEADER:\usepackage[english,russian]{babel}
#+LATEX_HEADER:\usepackage{mathtools}
#+LATEX_HEADER:\usepackage{amsthm}
#+OPTIONS: toc:nil
#+LANGUAGE: ru
#+LATEX_HEADER:\usepackage[top=0.8in, bottom=0.75in, left=0.625in, right=0.625in]{geometry}

#+LATEX_HEADER:\newcommand{\grad}{\operatorname{grad}}

#+LATEX_HEADER:\def\zall{\setcounter{lem}{0}\setcounter{cnsqnc}{0}\setcounter{th}{0}\setcounter{Cmt}{0}\setcounter{equation}{0}\setcounter{stnmt}{0}}

#+LATEX_HEADER:\newcounter{lem}\setcounter{lem}{0}
#+LATEX_HEADER:\def\lm{\par\smallskip\refstepcounter{lem}\textbf{\arabic{lem}}}
#+LATEX_HEADER:\newtheorem*{Lemma}{Лемма \lm}

#+LATEX_HEADER:\newcounter{th}\setcounter{th}{0}
#+LATEX_HEADER:\def\th{\par\smallskip\refstepcounter{th}\textbf{\arabic{th}}}
#+LATEX_HEADER:\newtheorem*{Theorem}{Теорема \th}

#+LATEX_HEADER:\newcounter{cnsqnc}\setcounter{cnsqnc}{0}
#+LATEX_HEADER:\def\cnsqnc{\par\smallskip\refstepcounter{cnsqnc}\textbf{\arabic{cnsqnc}}}
#+LATEX_HEADER:\newtheorem*{Consequence}{Следствие \cnsqnc}

#+LATEX_HEADER:\newcounter{Cmt}\setcounter{Cmt}{0}
#+LATEX_HEADER:\def\cmt{\par\smallskip\refstepcounter{Cmt}\textbf{\arabic{Cmt}}}
#+LATEX_HEADER:\newtheorem*{Note}{Замечание \cmt}

#+LATEX_HEADER:\newcounter{stnmt}\setcounter{stnmt}{0}
#+LATEX_HEADER:\def\st{\par\smallskip\refstepcounter{stnmt}\textbf{\arabic{stnmt}}}
#+LATEX_HEADER:\newtheorem*{Statement}{Утверждение \st}

* Задача 1
Построить двойственную к задаче линейного программирования:
#+begin_export latex
\begin{equation}
\max_{-1 \leq x \leq 1} (x + 1)
\end{equation}
#+end_export
Найти значения оптимума для прямой и двойственной задачи, проверить, что они совпадают.
** Решение
Запишем задачу в форме озЛП:
#+begin_export latex
\begin{equation}
(\max_{Ax \leq b}(c, x)) + 1,
\end{equation}
где
\begin{equation}
\begin{cases}
A = \begin{pmatrix}
1 \\
-1
\end{pmatrix}\\
b = \begin{pmatrix}
1 \\
1
\end{pmatrix}\\
c = 1
\end{cases}
\end{equation}
#+end_export
Соответственно, двойственная задача имеет вид:
#+begin_export latex
\begin{equation}
(\min_{\lambda A = c, \lambda \geq 0}(\lambda, b)) + 1,
\end{equation}
или
\begin{equation}
\min_{\lambda_1 - \lambda_2 = 1, \lambda_1 \geq 0, \lambda_2 \geq 0}(\lambda_1 + \lambda_2) + 1 = 
\min_{\lambda_1 \geq 1}(2\lambda_1 - 1) + 1 = 2\min_{\lambda_1 \geq 1}\lambda_1
\end{equation}

Максимум для прямой задачи достигается при $x = 1$, значение этого максимума равно 2.
Для двойственной задачи оптимум достигается при $\lambda_1 = 2, \lambda_2 = 0$ и равен так же 2.
#+end_export
